app/views/athletes/_athlete.html.erb

SELECT "training_sessions".* FROM "training_sessions" WHERE "training_sessions"."athlete_id" = 2
---

  <% sessions = athlete.training_sessions.to_a %>