app/controllers/athletes_controller.rb

  def index
    @athletes = current_user.athletes.includes(:training_sessions)
---
SELECT "athletes".* FROM "athletes" WHERE "athletes"."user_id" = 1
SELECT "training_sessions".* FROM "training_sessions" WHERE "training_sessions"."athlete_id" IN (1, 2, 3)

  def show
    @recent_training_sessions = @athlete.training_sessions.order(date: :desc).limit(5)
---
SELECT "training_sessions".* FROM "training_sessions" WHERE "training_sessions"."athlete_id" = 1 ORDER BY "training_sessions"."date" DESC LIMIT 5

  def create
    @athlete = current_user.athletes.new(athlete_params)

    respond_to do |format|
      if @athlete.save
---
INSERT INTO "athletes" ("profile", "name", "age", "sport_definition", "email", "created_at", "updated_at", "user_id") VALUES ('Ian''s Profile ', 'Ian Macdonald', 30, 'Basketball ', 'ianmacd@hotmail.co.uk', '2026-04-13 16:32:39.691134', '2026-04-13 16:32:39.691134', 1) RETURNING "id"

  def update
    respond_to do |format|
      if @athlete.update(athlete_params)
---
UPDATE "athletes" SET "profile" = 'Ian''s Profile ', "age" = 8, "sport_definition" = 'Football ', "email" = 'ianmacdonald@live.co.uk', "updated_at" = '2025-10-10 15:15:58.854425' WHERE "athletes"."id" = 2

  def stats
    @training_sessions = @athlete.training_sessions.order(date: :desc)

    @total_distance = @training_sessions.sum(:total_distance)
    @average_speed = @training_sessions.average(:average_speed) || 0
---
SELECT "training_sessions".* FROM "training_sessions" WHERE "training_sessions"."athlete_id" = 1 ORDER BY "training_sessions"."date" DESC
SELECT SUM("training_sessions"."total_distance") FROM "training_sessions" WHERE "training_sessions"."athlete_id" = 1

    def set_athlete
      @athlete = current_user.athletes.find(params[:id])
---
SELECT "athletes".* FROM "athletes" WHERE "athletes"."user_id" = 1 AND "athletes"."id" = 1 LIMIT 1