app/controllers/athletes_controller.rb

SELECT "athletes".* FROM "athletes" WHERE "athletes"."id" = 1 LIMIT 1
---
  def show
    @athlete = Athlete.find(params[:id])

SELECT SUM("total_distancedistance") FROM "training_sessions" WHERE "training_sessions"."athlete_id" = 1
---
  def stats
    @athlete = Athlete.find(params[:id])
    @total_distance = @athlete.training_sessions.sum(:total_distancedistance)

SELECT "athletes".* FROM "athletes" WHERE "athletes"."id" = 1 LIMIT 1
---
    def set_athlete
      @athlete = Athlete.find(params.expect(:id))