app/controllers/sessions_controller.rb

  def create
    email = params[:email].to_s.strip.downcase
    password = params[:password].to_s

    user = User.find_by(email: email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'ianmacd@hotmail.co.uk' LIMIT 1