app/controllers/training_sessions_controller.rb

  def create
    @training_session = @athlete.training_sessions.new(training_session_params)
    if @training_session.save
---
INSERT INTO "training_sessions" ("start_time", "finish_time", "average_speed", "total_distance", "date", "athlete_id", "created_at", "updated_at") VALUES ('2026-03-13 17:20:00', '2026-03-13 17:20:00', 12, 12.0, '2026-03-12', 1, '2026-03-13 17:20:49.039339', '2026-03-13 17:20:49.039339') RETURNING "id"

  def set_athlete
    @athlete = current_user.athletes.find(params[:athlete_id])
---
SELECT "athletes".* FROM "athletes" WHERE "athletes"."user_id" = 1 AND "athletes"."id" = 1 LIMIT 1